Repository: CherokeeLanguage/Action-Imitation-and-Fun-Series
Catalog: 06-Red-Riding-Hood/CAT/red-riding-hood-seven-kids/tm/corpus-nt-bbe.en.utf8.tmx
Source language: en
Languages: chr

source: Keep in mind, then, the teaching which was given to you, and be ruled by it and have a change of heart. If then you do not keep watch, I will come like a thief, and you will have no knowledge of the hour when I will come on you.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎭᏅᏓᏓ ᏄᏍᏛ ᏕᏣᏓᏂᎸᏨ ᎠᎴ ᏣᏛᎦᏅᎢ, ᎠᎴ ᎠᏍᏓᏯ ᏘᏂᏴ ᎠᎴ ᎯᏁᏟᏴᎾ ᏣᏓᏅᏛᎢ. ᎾᏍᎩ ᎢᏳᏍᏗ ᎢᏳᏃ ᏂᏯᏫᏍᎬᎾ ᎢᎨᏎᏍᏗ ᏓᎬᎷᏤᎵ ᎦᏃᏍᎩᏍᎩ ᏥᎦᎷᎪ ᎾᏍᎩᏯᎢ, ᎥᏝ ᎠᎴ ᏱᎦᏔᎮᏍᏗ ᎢᏳ ᎨᏒ ᏗᎬᎷᏤᎵᏒᎢ.

source: But you have some names in Sardis who have kept clean their robes; and as a reward they will go in white with me.
chr: ᎢᎸᏍᎩ ᏂᎦᎥ ᏚᎾᏙᎥ ᏕᏣᏍᏆᏂᎪᏗ ᏌᏗᏏ, ᎾᏍᎩ ᎦᏓᎭ ᎢᏧᏅᏁᎸᎯ ᏂᎨᏒᎾ ᏧᎾᏄᏬ; ᎠᎴ ᎾᏍᎩ ᎢᏧᎳᎭ ᏓᏲᏤᏙᎵ ᏧᏁᎩᏳ ᎨᏎᏍᏗ ᏚᎾᏄᏩᎥᎢ; ᏰᎵᏉᏰᏃ ᎾᏍᎩ ᎢᎬᏩᎾᏛᏁᏗ.

source: He who overcomes will be dressed in white, and I will not take his name from the book of life, and I will give witness to his name before my Father, and before his angels.
chr: ᎩᎶ ᎠᏓᏎᎪᎩᏍᎨᏍᏗ ᎾᏍᎩ ᏧᏁᎬ ᏣᏥᏄᏬᏍᏗ ᎨᏎᏍᏗ, ᎠᎴ ᎥᏝ ᏥᏲᏍᏓᏁᏗ ᏱᎨᏎᏍᏗ ᏚᏙᎥ ᎬᏂᏛ ᎠᏓᏁᎯ ᎪᏪᎵᎯ ᎪᏪᎸᎢ; ᎠᎴ ᎬᏂᎨᏒ ᎢᏥᏴᏁᏗ ᎨᏎᏍᏗ ᏕᎤᏙᎥ ᎡᏙᏓ ᎠᎦᏔᎲᎢ, ᎠᎴ ᏧᏤᎵ ᏗᏂᎧᎿᏩᏗᏙᎯ ᎠᏂᎧᏔᎲᎢ.

source: And to the angel of the church in Philadelphia say: These things says he who is holy, he who is true, he who has the key of David, opening the door so that it may be shut by no one, and shutting it so that it may be open to no one.
chr: ᏈᎵᏕᎵᏈᏃ ᎤᎾᏓᏡᎬ ᏧᎾᏁᎶᏗ ᏗᎧᎿᏩᏗᏙᎯ ᏫᏲᏪᎳᏏ; ᎯᎠ ᎾᏍᎩ ᏫᏂᏪᏏ ᎠᏗᎭ ᎾᏍᎩ Ꮎ ᎠᏍᎦᎾ ᏂᎨᏒᎾ, ᎾᏍᎩ ᎦᏰᎪᎩ ᏂᎨᏒᎾ, ᎾᏍᎩ ᎠᏍᏚᎢᏍᏗ ᏕᏫ ᎤᏤᎵᎦ ᎦᏁᎯ, ᎾᏍᎩ ᎠᏍᏚᎢᏍᎩ ᏥᎩ, ᎩᎶᏃ ᎠᏍᏚᎲᏍᎩ ᏂᎨᏒᎾ ᏥᎩ; ᎠᎴ ᎠᏍᏚᎲᏍᎩ, ᎩᎶᏃ ᎠᏍᏚᎢᏍᎩ ᏂᎨᏒᎾ ᏥᎩ.

source: I have knowledge of your works (see, I have put before you an open door which may be shut by no one), and that you have a little strength, and have kept my word, and have been true to my name.
chr: ᏥᎦᏔᎭ ᏄᏍᏛ ᏕᏣᎸᏫᏍᏓᏁᎲᎢ; ᎬᏂᏳᏉ ᎢᎬᏱᏢ ᏂᎬᏴᏂᏏ ᎠᏍᏚᎢᏛ ᎦᎶᎯᏍᏗᏱ, ᎥᏝᏃ ᎩᎶ ᎬᏩᏍᏚᏗ ᏱᎩ; ᎠᏏᏰᏃ ᎤᏍᏗᎩᏛ ᏣᎵᏂᎬᎦ, ᎠᎴ ᏣᏍᏆᏂᎪᏔᏅ ᎧᏃᎮᏛ ᎠᏆᏤᎵᎦ, ᎠᎴ ᎥᏝ ᏱᏣᏓᏱᎸ ᏓᏆᏙᎥᎢ.

source: See, I will make those of the Synagogue of Satan who say they are Jews, and are not, but say what is false; I will make them come and give worship before your feet, and see my love for you.
chr: ᎬᏂᏳᏉ ᏎᏓᏂ ᎤᏤᎵ ᏗᎦᎳᏫᎢᏍᏗᏱ ᎠᏁᎳ ᏅᏓᎦᏥᏴᏁᎵ, ᎾᏍᎩ Ꮎ ᎣᏥᏧᏏ ᏣᎾᏗᎭ, ᎠᏎᏃ ᎾᏍᎩ ᏄᎾᏍᏛᎾ ᏥᎩ, ᎠᎴ ᏣᎾᏥᎪᎥᏍᎦᏉ, ᎬᏂᏳᏉ ᎤᏂᎷᎯᏍᏗᏱ ᏅᏓᎦᏥᏴᏁᎵ ᎠᎴ ᎤᎾᏓᏙᎵᏍᏔᏂᎯᏍᏗᏱ ᏕᏣᎳᏍᎬᎢ, ᎠᎴ ᎤᏂᎦᏙᎥᏍᏗᏱ ᎬᎨᏳᎢᏳ ᎨᏒᎢ.

source: Because you have kept my word in quiet strength, I will keep you from the hour of testing which is coming on all the world, to put to the test those who are on earth.
chr: ᎾᏍᎩᏯᏃ ᎲᏂᏗᏳ ᎨᏒ ᏥᏣᏍᏆᏂᎪᏔᏅ ᎠᏆᏤᎵ ᎧᏃᎮᏛ, ᎾᏍᎩ ᎢᏳᏍᏗ ᎾᏍᏉ ᎠᏴ ᏓᎬᏍᏆᏂᎪᏔᏂ ᏓᎬᏳᏓᎴᏏ ᎾᎯᏳ ᎤᏓᎪᎵᏰᏗ ᎨᏒ ᎠᏍᏆᎸᎲᎭ, ᎡᎳᏂᎬ ᎤᏂᎷᏤᏗ ᏥᎩ, ᎤᏂᎪᎵᏰᏗᏱ ᎾᏍᎩ Ꮎ ᎡᎶᎯ ᏣᏁᎭ.

source: I come quickly: keep that which you have, so that no one may take your crown.
chr: ᎬᏂᏳᏉ ᏞᎩᏳ ᏓᏥᎷᏥ; ᎠᏍᏓᏱᏳ ᏕᏣᏂᏴᏎᏍᏗ ᎾᏍᎩ ᏣᎲᎢ, ᎾᏍᎩ ᎩᎶ ᎨᏣᎾᎡᏗ ᏂᎨᏒᎾ ᎢᏳᎵᏍᏙᏗᏱ ᎠᎵᏍᏚᎶ ᏣᏤᎵᎦ.

source: Him who overcomes I will make a pillar in the house of my God, and he will go out no more: and I will put on him the name of my God, and the name of the town of my God, the new Jerusalem, which comes down out of heaven from my God, and my new name.
chr: ᎩᎶ ᎠᏓᏎᎪᎩᏍᎨᏍᏗ ᎦᎫᏍᏛᏗ ᏅᏓᏥᏴᏁᎵ ᏗᎦᎳᏫᎢᏍᏗᏱ ᎠᏆᏁᎳᏅᎯ ᎤᏤᎵᎦ, ᎥᏝᏃ ᎿᏉ ᎢᎸᎯᏳ ᎤᏄᎪᎢᏍᏗ ᏱᎨᏎᏍᏗ; ᎠᎴ ᏓᏥᏲᏪᎶᏔᏂ ᏚᏙᎥ ᎠᏆᏁᎳᏅᎯ, ᎠᎴ ᏚᏙᎥ ᎦᏚᎲ ᎠᏆᏁᎳᏅᎯ ᎤᏤᎵᎦ, ᎾᏍᎩ ᎢᏤ ᏥᎷᏏᎵᎻ ᏥᎩ, ᎾᏍᎩ ᎦᎸᎶᎢ ᎤᏁᎳᏅᎯᏱ ᏣᏗᏓᎴᎲᏍᎦ; ᎠᎴ ᏓᏥᏲᏪᎶᏔᏂ ᎢᏤ ᏓᏆᏙᎥᎢ.

source: And to the angel of the church in Laodicea say: These things says the true and certain witness, the head of God's new order:
chr: ᎴᎣᏗᏏᏰᏃ ᏧᎾᏁᎶᏗ ᎤᎾᏓᏡᎬ ᏗᎧᎿᏩᏗᏙᎯ ᏫᏲᏪᎳᏏ; ᎯᎠ ᎾᏍᎩ ᏫᏂᏪᏏ ᎠᏗᎭ ᎾᏍᎩ ᎡᎺᏅ ᏥᏚᏙᎥ, ᎾᏍᎩ Ꮎ ᏄᏓᎵᏓᏍᏛᎾ ᎠᎴ ᎤᏙᎯᏳᎯᏯ ᎧᏃᎮᏍᎩ ᏥᎩ, ᏗᏓᎴᏅᏗᏍᎩ ᎤᏬᏢᏅᏅ ᎤᏁᎳᏅᎯ.

source: I have knowledge of your works, that you are not cold or warm: it would be better if you were cold or warm.
chr: ᏥᎦᏔᎭ ᏄᏍᏛ ᏕᏣᎸᏫᏍᏓᏁᎲᎢ, ᎾᏍᎩ ᏂᏣᏴᏢᎾ ᎠᎴ ᏂᏣᏗᎴᎬᎾ ᎨᏒᎢ; ᎤᏟ ᏱᏥᏰᎸᎾ ᏱᏣᏴᏜ ᎠᎴ ᏱᏣᏗᎴᎦᏉ.

source: So because you are not one thing or the other, I will have no more to do with you.
chr: ᎾᏍᎩᏃ ᏥᏣᎦᎾᏩᏉ, ᏂᏣᏴᏢᎾ ᎠᎴ ᏂᏣᏗᎴᎬᎾ ᏥᎩ, ᎾᏍᎩ ᎢᏳᏍᏗ ᏓᎬᏯᎵᎦᏍᏔᏂ ᏥᎣᎵ ᏓᎬᏄᎪᏫᏏ.

source: For you say, I have wealth, and have got together goods and land, and have need of nothing; and you are not conscious of your sad and unhappy condition, that you are poor and blind and without clothing.
chr: ᏅᏗᎦᎵᏍᏙᏗᎭ ᎯᎠ ᏥᏂᏪᎭ, ᎠᏇᎿᎠ, ᎠᎴ ᎠᏇᏅᏨ, ᎠᎴ ᎥᏝ ᎪᎱᏍᏗ ᏯᎩᏂᎬᏎᎭ; ᏂᎦᏔᎲᎾᏃ ᎢᎩ ᎤᏲ ᏂᏣᏛᎿᏕᎬᎢ, ᎠᎴ ᎤᏪᏙᎵᏍᏗ ᏂᏣᏛᎿᏕᎬᎢ, ᎠᎴ ᎪᎱᏍᏗ ᏂᏣᎲᎾ ᎨᏒᎢ, ᎠᎴ ᏘᎨᏫ ᎨᏒᎢ, ᎠᎴ ᏣᏰᎸᎭ ᎨᏒᎢ,

source: If you are wise you will get from me gold tested by fire, so that you may have true wealth; and white robes to put on, so that your shame may not be seen; and oil for your eyes, so that you may see.
chr: ᎬᏂᏤᎭ ᏍᎩᏩᎯᏎᏗᏱ ᎠᏕᎸ ᏓᎶᏂᎨ ᎠᏥᎸᏱ ᎬᏔᏅᎯ, ᎾᏍᎩ ᎤᏙᎯᏳᎯ ᏤᏅᎢᏍᏗᏱ; ᎠᎴ ᎤᏁᎬ ᎠᏄᏬ ᏣᏄᏬᏍᏗ, ᎾᏍᎩ ᎤᏕᎰᎯᏍᏗ ᏣᏲᏓᎦ ᎨᏒ ᎬᏂᎨᏒ ᎢᏳᎵᏍᏙᏗᏱ ᏂᎨᏒᎾ; ᎠᎴ ᏘᎦᏙᎵ ᏗᏣᎶᏁᏙᏗᏱ ᏗᎦᏔ-ᏗᎦᎶᏁᏗ, ᎾᏍᎩ ᎨᏣᎪᏩᏛᏗ ᎢᏳᎵᏍᏙᏗᏱ.

source: To all those who are dear to me, I give sharp words and punishment: then with all your heart have sorrow for your evil ways.
chr: ᎾᏂᎥ ᎦᏥᎨᏳᎢ ᎨᏒ ᏕᏥᎬᏍᎪᎸᎥᏍᎪ ᎠᎴ ᏕᏥᎩᎵᏲᎢᏍᏗᏍᎪᎢ; ᎾᏍᎩ ᎢᏳᏍᏗ ᎤᎵᏂᎩᏛ ᎭᏓᏅᏓᏓ ᎯᏁᏟᏴᎾ ᏣᏓᏅᏛᎢ.

source: See, I am waiting at the door and giving the sign; if my voice comes to any man's ears and he makes the door open, I will come in to him, and will take food with him and he with me.
chr: ᎬᏂᏳᏉ ᏥᏙᎦ ᎦᎶᎯᏍᏗᏱ ᎠᎴ ᎬᏂᎭ; ᎩᎶ ᎠᏛᎩᏍᎨᏍᏗ ᏥᏁᎬ ᎠᎴ ᎠᏍᏚᎢᏍᎨᏍᏗ ᎦᎶᎯᏍᏗᏱ, ᏓᏥᏴᎵ ᎠᏯᎥᎢ, ᎠᎴ ᏓᎦᎵᏍᏓᏴᏂ ᎠᎵᏍᏓᏴᎲᏍᎬᎢ, ᎠᎴ ᎾᏍᎩ ᏛᎵᏍᏓᏴᏂ ᎦᎵᏍᏓᏴᎲᏍᎬᎢ.

source: To him who overcomes I will give a place with me on my high seat, even as I overcame, and am seated with my Father on his high seat.
chr: ᎩᎶ ᎠᏓᏎᎪᎩᏍᎨᏍᏗ ᏓᏥᏯᎵᎪᎸᏓᏁᎵ ᎤᏪᏗᏱ ᎠᏉᎸᎢ ᎠᏆᏤᎵ ᎦᏍᎩᎸᎢ, ᎾᏍᎩᏯ ᏣᏆᏓᏎᎪᎩᏒ ᎠᎴ ᏣᎩᏅ ᎡᏙᏓ ᎤᏬᎸ ᎾᏍᎩ ᎤᏪᏍᎩᎸᎢ.

source: After these things I saw a door open in heaven, and the first voice came to my ears, like the sound of a horn, saying, Come up here, and I will make clear to you the things which are to come.
chr: ᎣᏂᏃ ᏓᏆᎧᎿᏅᎩ, ᎠᎴ ᎬᏂᏳᏉ ᎦᎶᎯᏍᏗᏱ ᎤᎵᏍᏚᎢᏛ ᎨᏒᎩ ᎦᎸᎳᏗ; ᎢᎬᏱᏱᏃ ᎧᏁᎬ ᎠᏆᏛᎦᏅᎯ ᎠᏤᎷᎩ ᏣᏆᎵᏃᎮᏗᏍᎪ ᎾᏍᎩᏯ ᎨᏒᎩ; ᎯᎠ ᏥᎾᎩᏪᏎᎰᎢ, ᎡᎭᎩᎳᏩ, ᏓᎬᎾᏄᎪᏫᏎᎵᏃ ᏧᏓᎴᏅᏛ ᎾᏍᎩ ᎣᏂ ᎢᏳᎵᏍᏔᏂᏓᏍᏗ ᎨᏒᎢ.

source: Straight away I was in the Spirit: and I saw a high seat in heaven, and one was seated on it;
chr: ᎩᎳᏉᏃ ᎢᏴᏛ ᎠᏓᏅᏙ ᎠᏆᏘᏂᏙᎲᎩ; ᎠᎴ ᎬᏂᏳᏉ ᎦᏍᎩᎶ ᎦᎸᎶᎢ ᎤᏂᏍᎩᎳᏛᎩ, ᎩᎶᏃ ᎾᎿ ᎦᏍᎩᎸ ᎤᏪᏅᎩ.

source: And to my eyes he was like a jasper and a sardius stone: and there was an arch of light round the high seat, like an emerald.
chr: ᎤᏬᎵᏃ ᏣᎦᎦᏃᏗᏱ ᏣᏍᏆ ᏅᏯ ᎾᏍᎩᏯ ᎨᏒᎩ, ᎠᎴ ᏌᏗᏂ ᏅᏯ; ᎤᏅᎪᏔᏛᎩᏃ ᎬᏩᏚᏫᏛ ᎦᏍᎩᎸᎢ, ᏗᎧᏃᏗᏱ ᎡᎻᎳ ᏅᏯ ᎾᏍᎩᏯ ᎨᏒᎩ.

source: And round about the high seat were four and twenty seats: and on them I saw four and twenty rulers seated, clothed in white robes; and on their heads crowns of gold.
chr: ᎠᎴ ᎬᏩᏚᏫᏛ ᎾᎿ ᎦᏍᎩᎸ ᏅᎩᏦᏁ ᏕᎦᎧᎲ ᏗᏍᎩᎳᏗᏍᏗ; ᏗᏍᎩᎳᏗᏍᏗᏱᏃ ᎥᎦᏥᎪᎥᎩ ᏅᎩᏦᏁ ᎢᏯᏂᏛ ᏧᎾᏛᏐᏅᎯ ᎠᏂᏅᎩ ᏧᏁᎬ ᏚᎾᏄᏩᎥᎩ; ᏚᎾᎵᏍᏚᎸᏃ ᏗᎵᏍᏚᎶ ᎠᏕᎸ ᏓᎶᏂᎨ ᏗᎪᏢᏔᏅᎯ.

source: And out of the high seat came flames and voices and thunders. And seven lights of fire were burning before the high seat, which are the seven Spirits of God;
chr: ᎦᏍᎩᎸᏃ ᏓᏓᎴᎲᏍᎬᎩ ᎠᎾᎦᎵᏍᎩ, ᎠᎴ ᎠᏴᏓᏆᎶᏍᎩ ᎠᎴ ᎤᏃᏴᎬᎢ; ᎠᎴ ᎦᎵᏉᎩ ᏗᏨᏍᏙᏗ ᏧᏥᏍᏟ ᏓᏓᏪᎵᎩᏍᎬᎩ ᎢᎬᏱᏗᏢ ᎦᏍᎩᎸᎢ, ᎯᎠ ᎾᏍᎩ ᎦᎵᏉᎩ ᏗᏓᏅᏙ ᎤᏁᎳᏅᎯ ᏧᏤᎵᎦ.

source: And before the high seat there was, as it seemed, a clear sea of glass; and in the middle of the high seat, and round about it, four beasts full of eyes round about.
chr: ᎦᏍᎩᎸᏃ ᎢᎬᏱᏗᏢ ᎥᏓᎸᎩ ᎠᏓᎰᏗ ᎢᏗᎬᏤᎵᏛ, ᏅᏯ ᏗᎬᏩᎸᏌᏛ ᎾᏍᎩᏯ ᎨᏒᎩ; ᎦᏍᎩᎸᏃ ᎠᏰᎵ, ᎠᎴ ᎬᏩᏚᏫᏛ ᎾᎿ ᎦᏍᎩᎸ ᏅᎩ ᎢᏯᏂᏛ ᏗᏅᏃᏛ ᎥᎦᏥᎪᎥᎩ, ᎠᎧᎵᏬᎯ ᏓᏂᎧᏅᎩ ᎢᎬᏱᏗᏢ ᎠᎴ ᎣᏂᏗᏢ.

source: And the first beast was like a lion, and the second like an ox, and the third had a face like a man, and the fourth was like an eagle in flight.
chr: ᎢᎬᏱᏱ ᎾᏍᎩ ᎯᎠ ᎬᏃᏛ ᏢᏓᏥ ᎤᏃᏕᎾ ᎾᏍᎩᏯ ᎨᏒᎩ, ᏔᎵᏁᏃ ᎾᏍᎩ ᎯᎠ ᎬᏃᏛ ᏩᎦ ᎠᎩᎾ ᎾᏍᎩᏯ ᎨᏒᎩ, ᏦᎢᏁᏃ ᎾᏍᎩ ᎯᎠ ᎬᏃᏛ ᏴᏫ ᎤᎧᏛ ᎾᏍᎩᏯ ᎤᎧᏛᎩ, ᎤᎩᏁᏃ ᎾᏍᎩ ᎯᎠ ᎬᏃᏛ ᎦᏃᎯᎵᏙᎯ ᎠᏬᎭᎵ ᎾᏍᎩᏯ ᎨᏒᎩ.

source: And the four beasts, having every one of them six wings, are full of eyes round about and inside: and without resting day and night, they say, Holy, holy, holy, Lord God, Ruler of all, who was and is and is to come.
chr: ᎾᏍᎩᏃ ᏅᎩ ᎢᏯᏂᏛ ᏗᏅᏃᏛ ᎠᏂᏏᏴᏫᎭ ᏑᏓᎵ ᏓᏃᏯᏛᎩ; ᎬᏩᏚᏫᏛᏃ ᎠᎴ ᎭᏫᏂ ᎧᎵᏬᎯ ᎨᏒ ᏗᏂᎧᏅᎢ; ᎠᎴ ᎾᎾᏣᏪᏐᎸᏍᏗᏍᎬᎾ ᎨᏐ ᎢᎦ ᎠᎴ ᏒᏃᏱ ᎯᎠ ᎾᏂᏪᏍᎬᎢ; ᎦᎸᏉᏗᏳ, ᎦᎸᏉᏗᏳ, ᎦᎸᏉᏗᏳ, ᎤᎬᏫᏳᎯ ᎤᏁᎳᏅᎯ ᏫᎾᏍᏛᎾ ᎤᎵᏂᎩᏛ, ᎾᏍᎩ ᏤᎲᎩ, ᎠᎴ ᏤᎭ, ᎠᎴ ᏤᎮᏍᏗ.

source: And when the beasts give glory and honour to him who is seated on the high seat, to him who is living for ever and ever,
chr: ᎾᏍᎩᏃ ᏗᏅᏃᏛ ᎠᏂᎸᏉᏓ ᎠᎴ ᎠᎾᎵᎮᎵᏥ ᎾᏍᎩ ᎦᏍᎩᎸ ᎤᏬᎵ, ᎾᏍᎩ ᏂᎪᎯᎸ ᎾᎵᏍᏆᏗᏍᎬᎾ ᏤᎭ,

source: The four and twenty rulers go down on their faces before him who is seated on the high seat, and give worship to him who is living for ever and ever, and take off their crowns before the high seat, saying,
chr: ᎿᏉ ᏅᎩᏦᏁ ᎢᏯᏂᏛ ᏧᎾᏛᏐᏅᎯ ᎡᎳᏗ ᏓᎾᏓᏅᎥᏍᎪ ᎢᎬᏱᏗᏢ ᎤᏬᎸ ᎾᏍᎩ ᎦᏍᎩᎸ ᎤᏬᎵ, ᎠᎴ ᎠᎾᏓᏙᎵᏍᏓᏁᎰ ᎾᏍᎩ Ꮎ ᏂᎪᎯᎸ ᎾᎵᏍᏆᏗᏍᎬᎾ ᏤᎭ, ᎠᎴ ᏧᎾᎵᏍᏚᎶ ᎦᏍᎩᎸ ᎢᎬᏱᏗᏢ ᏚᎾᏓᎡᎯ, ᎯᎠ ᎾᏂᏪᏍᎪᎢ;

source: It is right, our Lord and our God, for you to have glory and honour and power: because by you were all things made, and by your desire they came into being.
chr: ᏰᎵᏉ ᏂᎯ ᏣᎬᏫᏳᎯ ᎦᏰᏣᏁᎢᏍᏓᏁᏗ ᎡᏣᎸᏉᏗᏳ ᎨᏒ, ᎠᎴ ᎡᏣᎸᏉᏙᏗ ᎨᏒ, ᎠᎴ ᏣᎵᏂᎩᏗᏳ ᎨᏒᎢ; ᏂᎦᏗᏳᏰᏃ ᎪᎱᏍᏗ ᏦᏢᏅᎯ, ᎠᎴ ᎭᏓᏅᏖᏍᎬ ᎢᏨᏁᎵᏓᏍᏗᏱ ᎡᎭ, ᎠᎴ ᎪᏢᏅᎯ.

source: And I saw in the right hand of him who was seated on the high seat, a book with writing inside it and on the back, shut with seven stamps of wax.
chr: ᎠᎴ ᎠᎩᎪᎲᎩ ᎪᏪᎵ ᎠᎦᏘᏏᏗᏢ ᎤᏬᏰᏂ ᎤᏒᎦᎸᎩ ᎾᏍᎩ Ꮎ ᎦᏍᎩᎸ ᎤᏬᎵ, ᎭᏫᏂᏗᏢ, ᎠᎴ ᎦᏚᎢᏗᏢ ᎪᏪᎸᎩ ᎦᎵᏉᎩ ᎪᏪᎵ ᏗᏍᏚᏗ ᏓᏍᏚᏛᎩ.

source: And I saw a strong angel saying in a loud voice, Who is able to make the book open, and to undo its stamps?
chr: ᎠᎴ ᏗᎧᎿᏩᏗᏙᎯ ᎤᎵᏂᎩᏛ ᎥᏥᎪᎥᎩ ᎤᏪᎷᎬᎩ ᎠᏍᏓᏯ ᎧᏁᎬᎩ, ᎯᎠ ᏂᎦᏪᏍᎬᎩ, ᎦᎪ ᏰᎵ ᎬᏩᏍᏚᎢᏍᏗ ᎪᏪᎵ, ᎠᎴ ᏗᎬᏩᏲᏍᏙᏗ ᎾᏍᎩ ᏓᏍᏚᏛᎢ?

source: And no one in heaven, or on the earth, or under the earth, was able to get the book open, or to see what was in it.
chr: ᎥᏝᏃ ᎩᎶ ᎦᎸᎳᏗ, ᎠᎴ ᎡᎶᎯ, ᎠᎴ ᎡᎶᎯ ᎭᏫᏂᏗᏢ ᏰᎵ ᎬᏩᏛᏗ ᏱᎨᏎ ᎪᏪᎵ ᎬᏩᏍᏚᎢᏍᏗ, ᎠᎴ ᎾᏍᎩ ᎾᎿ ᏗᎬᏩᎧᏃᏗ.

source: And I was very sad, because there was no one able to get the book open or to see what was in it.
chr: ᎤᏣᏘᏃ ᏓᏆᏠᏱᎸᎩ, ᏅᏓᎦᎵᏍᏙᏗᏍᎬᎩ ᎩᎶ ᎬᏩᏛᏗ ᏂᎨᏒᎾ ᎨᏒ ᏰᎵ ᎬᏩᏍᏚᎢᏍᏗ ᎠᎴ ᎬᏩᎪᎵᏰᏗ ᎨᏒ ᎪᏪᎵ, ᎠᎴ ᎾᏍᎩ ᎾᎿ ᏗᎬᏩᎧᏃᏗ.

source: And one of the rulers said to me, Do not be sad: see, the Lion of the tribe of Judah, the Root of David, has overcome, and has power to undo the book and its seven stamps.
chr: ᎠᏏᏴᏫᏃ ᎾᏍᎩ ᎫᎾᏛᏐᏅᎯ ᎨᏒ ᎯᎠ ᎾᎩᏪᏎᎸᎩ, ᏞᏍᏗ ᏗᏣᏠᏱᎸᎩ; ᎬᏂᏳᏉ ᏢᏓᏥ ᎤᏃᏕᎾ ᏧᏓ ᎠᏂᎳᏍᏓᎸ ᏅᏓᏳᏓᎴᏅᎯ, ᏕᏫ ᎤᏱᏝᏅᎯ, ᎤᏓᏎᎪᎩᏒ ᎤᏍᏚᎢᏍᏗᏱ ᎪᏪᎵ, ᎠᎴ ᏧᏲᏍᏙᏗᏱ ᎦᎵᏉᎩ ᏂᏓᏍᏚᎲᎢ.

source: And I saw in the middle of the high seat and of the four beasts, and in the middle of the rulers, a Lamb in his place, which seemed as if it had been put to death, having seven horns and seven eyes, which are the seven Spirits of God, sent out into all the earth.
chr: ᎠᎴ ᏓᏆᎧᎿᏅᎩ, ᎠᎴ ᎬᏂᏳᏉ, ᎠᏰᎵ ᎦᏍᎩᎸᎢ ᎠᎴ ᎠᏰᎵ ᏄᎾᏛᏅ ᎾᏍᎩ Ꮎ ᏅᎩ ᎢᏯᏂᏛ ᏗᏅᏃᏛ, ᎠᎴ ᎠᏰᎵ ᎠᏂᏅ ᏧᎾᏛᏐᏅᎯ, ᎥᎦᏙᎬᎩ ᎤᏃᏕᎾ ᎠᎩᎾ, ᎠᎸᎯ ᎢᏳᏍᏗ ᎨᏒᎩ, ᎦᎵᏉᎩ ᏚᎷᎬᎩ, ᎠᎴ ᎦᎵᏉᎩ ᏓᎧᏅᎩ, ᎾᏍᎩ ᎦᎵᏉᎩ ᏗᏓᏅᏙ ᎤᏁᎳᏅᎯ ᏧᏤᎵ ᎦᏛᎦ, ᎾᏍᎩ ᏂᎬᎾᏛ ᎡᎶᎯ ᏗᎦᏅᏒᎯ ᏥᎩ.

source: And he came and took it out of the right hand of him who was seated on the high seat.
chr: ᎾᏍᎩᏃ Ꮎ ᎤᎷᏨᎩ ᎠᎴ ᎤᏁᏒᎩ ᎪᏪᎵ ᎾᏍᎩ ᎠᎦᏘᏏᏗᏢ ᎤᏬᏰᏂ ᎤᏒᎦᎸ ᎾᏍᎩ Ꮎ ᎦᏍᎩᎸ ᎤᏬᎵ.

source: And when he had taken the book, the four beasts and the four and twenty rulers went down on their faces before the Lamb, having every one an instrument of music, and gold vessels full of perfumes, which are the prayers of the saints.
chr: ᎤᏁᏒᏃ ᎪᏪᎵ, ᎾᏍᎩ Ꮎ ᏅᎩ ᎢᏯᏂᏛ ᏗᏅᏃᏛ ᎠᎴ ᏅᎩᏦᏁ ᎢᏯᏂᏛ ᏧᎾᏛᏐᏅᎯ ᎡᎳᏗ ᏓᎾᏓᏅᏅᎩ ᎠᎦᏔᎲ ᎤᏃᏕᎾ ᎠᎩᎾ, ᏗᏂᏁᎯᎭ ᎨᏒᎩ ᏗᎧᏃᎩᏍᏙᏗ, ᎠᎴ ᏗᏖᎵᏙ ᎠᏕᎸ ᏓᎶᏂᎨ ᏗᎪᏢᏔᏅᎯ ᏗᎧᎵᎢ ᎨᏒᎩ ᎠᏜ ᎦᏩᏒᎩ, ᎾᏍᎩ ᎤᎾᏓᏅᏘ ᎠᎾᏓᏙᎵᏍᏗᏍᎬ ᏥᎩ.

source: And their voices are sounding in a new song, saying, It is right for you to take the book and to make it open: for you were put to death and have made an offering to God of your blood for men of every tribe, and language, and people, and nation,
chr: ᎢᏤᏃ ᏗᎧᏃᎩᏍᏗ ᏚᏂᏃᎩᏒᎩ, ᎯᎠ ᏄᏂᏪᏒᎩ; ᏚᏳᎪᏗ ᏂᎯ ᏣᏁᏍᏗᏱ ᎪᏪᎵ ᎠᎴ ᏗᏣᏲᏍᏙᏗᏱ ᏓᏍᏚᎲᎢ; ᎡᏣᎸᎩᏰᏃ, ᎠᎴ ᎤᏁᎳᏅᎯ ᏧᏤᎵ ᏂᏍᎩᏴᏁᎸ ᏣᎩᎬ ᏍᎩᏩᎯᏍᏔᏅ, ᏫᏗᏍᎩᏯᏅᎲ ᏂᎦᏛ ᏓᏂᎳᏍᏓᎳᏩᏗᏒᎢ, ᎠᎴ ᏧᏓᎴᏅᏛ ᏗᏂᏬᏂᏍᎩ ᎨᏒᎢ, ᎠᎴ ᏧᎾᏓᎴᏅᏛ ᏴᏫ, ᎠᎴ ᏧᎾᏓᎴᏅᏛ ᏓᏁᏩᏗᏒᎢ.

source: And have made them a kingdom and priests to our God, and they are ruling on the earth.
chr: ᎠᎴ ᎣᎦᏁᎳᏅᎯ ᏧᏤᎵ ᎣᎩᎬᏫᏳᎯ ᎠᎴ ᎠᏥᎸ ᎣᏤᎶᎯ ᏂᏍᎩᏴᏁᎸ; ᎠᎴ ᎣᎩᎬᎾᏳᎯ ᎨᏎᏍᏗ ᎡᎶᎯ.

source: And I saw, and there came to my ears the sound of a great number of angels round about the high seat and the beasts and the rulers; and the number of them was ten thousand times ten thousand, and thousands of thousands;
chr: ᎠᎴ ᏓᏆᎧᎿᏅᎩ, ᎠᎴ ᎠᏆᏛᎦᏅᎩ ᎠᏂᏁᎬ ᎤᏂᏣᏘ ᏗᏂᎧᎿᏩᏗᏙᎯ ᏚᎾᏚᏫᏍᏛ ᎦᏍᎩᎸᎢ, ᎠᎴ ᎠᏂᏁᎬ ᏗᏅᏃᏛ ᎠᎴ ᏧᎾᏛᏐᏅᎯ; ᎯᎠᏃ ᎾᏂᎥᎩ, ᎠᏍᎪᎯ ᎢᏯᎦᏴᎵ ᎤᎶᏏᎶᏛ ᎠᏍᎪᎯ ᎢᏯᎦᏴᎵ, ᎠᎴ ᎠᎦᏴᎵ ᎤᎦᏴᎳᏥᎶᏛ.

source: Saying with a great voice, It is right to give to the Lamb who was put to death, power and wealth and wisdom and strength and honour and glory and blessing.
chr: ᎯᎠ ᎾᏂᏪᏍᎬᎩ ᎠᏍᏓᏯ ᎤᏁᎷᎬᎩ; ᎤᏃᏕᎾ ᎠᎩᎾ ᎠᏥᎸᎯ ᏰᎵᏉ ᎦᏁᎢᏍᏓᏁᏗ ᎤᎵᏂᎩᏗᏳ ᎨᏒ, ᎠᎴ ᎤᏪᎿᎢᏳ ᎨᏒ, ᎠᎴ ᎠᏏᎾᏌᏂᏳ ᎨᏒ, ᎠᎴ ᎬᏩᏄᎸᏗ ᏂᎨᏒᎾ ᎨᏒ, ᎠᎴ ᎦᎸᏉᏗᏳ ᎨᏒ, ᎠᎴ ᎣᏍᏛ ᎧᏁᎢᏍᏓᏁᏗ ᎨᏒᎢ.

source: And to my ears came the voice of everything in heaven and on earth and under the earth and in the sea, and of all things which are in them, saying, To him who is seated on the high seat, and to the Lamb, may blessing and honour and glory and power be given for ever and ever.
chr: ᏂᎦᏗᏳᏃ ᎪᏢᏅᎯ ᎨᏒ ᎦᎸᎳᏗ ᎡᎲ, ᎠᎴ ᎡᎶᎯ ᎡᎲ, ᎠᎴ ᎡᎶᎯ ᎭᏫᏂᏗᏢ ᎡᎲ, ᎠᎴ ᎾᏍᎩ ᎠᎺᏉᎯ ᎠᏁᎲ, ᎠᎴ ᏂᎦᏛ ᎾᎿ ᎠᏂᏯᎥᎢ, ᎠᏆᏛᎦᏅᎩ ᎯᎠ ᎾᏂᏪᏍᎬᎢ, ᎣᏍᏛ ᎧᏁᎢᏍᏓᏁᏗ ᎨᏎᏍᏗ, ᎠᎴ ᎦᎸᏉᏗᏳ ᎨᏎᏍᏗ, ᎠᎴ ᎦᎸᏉᏙᏗ ᎨᏎᏍᏗ, ᎠᎴ ᎤᎵᏂᎩᏗᏳ ᎨᏎᏍᏗ ᎾᏍᎩ ᎦᏍᎩᎸ ᎤᏬᎵ, ᎠᎴ ᎾᏍᏉ ᎤᏃᏕᎾ ᎠᎩᎾ ᎤᎵᏍᏆᏗᏍᏗ ᏂᎨᏒᎾ ᏂᎪᎯᎸᎢ.

source: And the four beasts said, So be it. And the rulers went down on their faces and gave worship.
chr: ᏅᎩᏃ ᎢᏯᏂᏛ ᏗᏅᏃᏛ ᎡᎺᏅ ᎤᎾᏛᏅᎩ. ᏅᎩᏦᏁᏃ ᎢᏯᏂᏛ ᏧᎾᏛᏐᏅᎯ ᎡᎳᏗ ᏚᎾᏓᏅᏅᎩ ᎠᎴ ᎤᎾᏓᏙᎵᏍᏓᏁᎸᎩ ᎾᏍᎩ Ꮎ ᏂᎪᎯᎸ ᎤᎵᏍᏆᏗᏍᏗ ᏂᎨᏒᎾ ᎡᎯ.

source: And I saw when the Lamb undid one of the stamps, and the voice of one of the four beasts came to my ears, saying as with a voice of thunder, Come and see.
chr: ᎠᎴ ᏕᏥᎦᏅᎩ ᎤᏃᏕᎾ ᎠᎩᎾ ᎤᏲᏍᏔᏅ ᏌᏉ ᎠᏍᏚᏛ ᎪᏪᎵ; ᎠᎴ ᎠᏆᏛᎦᏅᎩ ᎠᏴᏓᏆᎶᏍᎩ ᏧᏃᏴᎪ ᎾᏍᎩᏯᎢ, ᎾᏍᎩ Ꮎ ᎠᏏᏴᏫ ᏅᎩ ᎢᏯᏂᏛ ᎨᏒ ᏗᏅᏃᏛ, ᎯᎠ ᏂᎦᏪᏍᎬᎩ, ᎡᎭᎦᏔᏄᎦ.

source: And I saw a white horse, and he who was seated on it had a bow; and there was given to him a crown: and he went out with power to overcome.
chr: ᎠᎴ ᏫᏓᏆᎧᎾᏅᎩ, ᎠᎴ ᎬᏂᏳᏉ ᎤᏁᎬ ᏐᏈᎵ [ᏫᏥᎪᎥᎩ] ᎠᎴ ᎾᎿ ᎤᎩᎵ ᎦᎶᏣᏗ ᎦᏁᎲᎩ; ᎠᎴ ᎠᎵᏍᏚᎶ ᎠᏥᏅᏁᎸᎩ; ᎠᎴ ᎤᏪᏅᏒᎩ ᏫᏓᏎᎪᎩᏍᎬᎩ, ᎠᎴ ᏫᎬᏓᏎᎪᎩᏏᏒᎩ.

source: And when the second stamp was undone, the voice of the second beast came to my ears, saying, Come and see.
chr: ᎠᎴ ᏔᎵᏁ ᎠᏍᏚᎲ ᎤᏍᏚᎢᏒ, ᎠᏆᏛᎦᏅᎩ ᏔᎵᏁ ᎬᏃᏛ ᎯᎠ ᏄᏪᏒᎩ, ᎡᎭᎦᏔᏄᎦ.

source: And another horse came out, a red horse; and it was given to him who was seated on it to take peace from the earth, so that people might put one another to death: and there was given to him a great sword.
chr: ᎠᎴ ᏅᏩᏓᎴ ᏐᏈᎵ ᎤᏄᎪᏨᎩ, ᎠᎩᎦᎨᎢ; ᎠᎴ ᎠᎦᎵᏍᎪᎸᏓᏁᎸᎩ ᎾᎿ ᎤᎩᎵ ᏅᏩᏙᎯᏯᏛ ᎨᏒ ᎤᏄᎪᏫᏍᏗᏱ ᎡᎶᎯ, ᎠᎴ ᎾᏍᎩ ᎢᏳᏩᏂᏐᏗᏱ ᎤᏅᏒᏉ ᏧᎾᏓᎯᏍᏗᏱ; ᎠᎴ ᎡᏆ ᎠᏰᎳᏍᏗᎦᏅᎯᏛ ᎠᏥᏕᎸᎩ.

source: And when the third stamp was undone, the voice of the third beast came to my ears, saying, Come and see. And I saw a black horse; and he who was seated on it had scales in his hand.
chr: ᎠᎴ ᏦᎢᏁ ᎠᏍᏚᎲ ᎤᏍᏚᎢᏒ, ᎠᏆᏛᎦᏅᎩ ᏦᎢᏁ ᎾᏍᎩ Ꮎ ᎬᏃᏛ ᎯᎠ ᏄᏪᏒᎩ, ᎡᎭᎦᏔᏄᎦ. ᎠᎴ ᏓᏆᎧᎾᏅᎩ, ᎠᎴ ᎬᏂᏳᏉ ᎬᎿᎨ ᏐᏈᎵ; ᎠᎴ ᎾᎿ ᎤᎩᎵ ᏗᎦᏛᏗ ᏕᎦᏁᎲᎩ.

source: And a voice came to my ears, from the middle of the four beasts, saying, A measure of grain for a penny, and three measures of barley for a penny: and see that you do no damage to the oil and the wine.
chr: ᎠᎴ ᎧᏁᎬ ᎠᏆᏛᎦᏅᎩ [ᏛᏓᎴᎲᏍᎬᎩ] ᎠᏰᎵ ᏅᎩ ᎢᏯᏂᏛ ᏗᏅᏃᏛ ᏄᎾᏛᏅᎢ, ᎯᎠ ᏅᏓᎦᏪᏍᎬᎩ, ᏥᏂᎩ ᎠᏟᎶᏍᏗ ᎠᎧᎵᎢ ᎤᏣᎴᏍᏗ ᎠᎩᏏᏧᎬᏩᎶᏗ ᎠᎫᏴᏗ, ᎠᎴ ᏥᏂᎩ ᎠᏟᎶᏍᏗ ᏦᎢ ᎢᏯᎧᎵᎢ ᎤᏣᎴᏍᏗ ᎢᏳᏍᏗ ᎠᎩᏏ-ᏧᎬᏩᎶᏗ ᎠᎫᏴᏗ; ᎠᎴ ᏞᏍᏗ ᎪᎱᏍᏗ ᏗᏨᏁᎸᎩ ᎪᎢ ᎠᎴ ᎩᎦᎨ-ᎠᏗᏔᏍᏗ.

source: And when the fourth stamp was undone, the voice of the fourth beast came to my ears, saying, Come and see.
chr: ᎠᎴ ᏅᎩᏁ ᎠᏍᏚᎲ ᎤᏍᏚᎢᏒ, ᎠᏆᏛᎦᏅᎩ ᎧᏁᎬ ᏅᎩᏁ ᎾᏍᎩ Ꮎ ᎬᏃᏛ ᎯᎠ ᏂᎦᏪᏍᎬᎢ, ᎡᎭᎦᏔᏄᎦ.

source: And I saw a grey horse, and the name of him who was seated on it was Death; and Hell came after him. And there was given to them authority over the fourth part of the earth, to put to destruction by the sword, and by taking away their food, and by death, and by the beasts of the earth.
chr: ᎠᎴ ᏫᏓᏆᎧᎾᏅᎩ, ᎠᎴ ᎬᏂᏳᏉ ᎤᏬᏓᎸ [ᏗᎧᏃᏗᏱ] ᏐᏈᎵ [ᏫᏥᎪᎥᎩ]; ᎠᎴ ᎾᎿ ᎤᎩᎵ ᎠᏲᎱᎯᏍᏗ ᏚᏙᎥᎩ, ᎠᎴ ᏨᏍᎩᏃ ᎤᏍᏓᏩᏗᏒᎩ; ᎠᎴ ᎨᎦᎵᏍᎪᎸᏓᏁᎸᎩ ᎾᏍᎩ ᏅᎩ ᎢᎦᏛᎯ ᎨᏒ ᎡᎶᎯ ᎾᏍᎩ ᏌᏉ ᏄᏓᎥ ᎾᎿ ᏧᏂᎯᏍᏗᏱ ᎠᏰᎳᏍᏗᎦᏅᎯᏛ ᎬᏗ, ᎠᎴ ᎠᎪᏄ ᎬᏗ, ᎠᎴ ᎥᏳᎩ ᎬᏗ, ᎠᎴ ᎢᎾᎨ ᎠᏁᎯ ᎤᏂᏍᎦᏎᏗ ᏗᎬᏗ.

source: And when the fifth stamp was undone, I saw under the altar the souls of those who had been put to death for the word of God, and for the witness which they kept.
chr: ᎠᎴ ᎯᏍᎩᏁ ᎠᏍᏚᎲ ᎤᏍᏚᎢᏒ, ᎠᏥᎸᎨᎳᏍᏗᏱ ᎭᏫᏂᏢ ᏓᎩᎪᎲᎩ ᏧᎾᏓᏅᏙ ᎾᏍᎩ Ꮎ ᏗᎨᏥᎸᎯ ᎤᏁᎳᏅᎯ ᎤᏤᎵ ᎧᏃᎮᏛ ᎤᏂᏍᏛᏛᎯ, ᎠᎴ ᏄᏍᏛ ᎤᏃᎯᏳᏔᏅ ᎤᏂᏍᏛᏛᎯ;

source: And they gave a great cry, saying, How long will it be, O Ruler, holy and true, before you take your place as judge and give punishment for our blood to those on the earth?
chr: ᎠᎴ ᎠᏍᏓᏯ ᎤᏁᎷᏅᎩ ᎯᎠ ᏄᏂᏪᏒᎩ, ᎢᎳᎪ ᏅᏓᎪᎯᏥ ᏣᎬᏫᏳᎯ, ᏂᎯ ᏂᏍᎦᏅᎾ ᎠᎴ ᏚᏳᎪᏛ ᎢᎭᏛᏁᎯ, ᎩᎳ ᏙᏓᎩᏳᎪᏓᏁᎸ ᏓᎩᏍᏛᏗᏍᏔᏂ ᎠᎴ ᏓᎩᏯᏞᏤᎢ ᎣᎩᎩᎬ [ᎤᏂᏨᏅ] ᎾᏍᎩ Ꮎ ᎡᎶᎯ ᏣᏁᎭ.

source: And there was given to every one a white robe, and they were ordered to take their rest for a little time, till the number was complete of the other servants, their brothers, who would be put to death, even as they had been.
chr: ᎠᎴ ᎠᏂᏏᏴᏫᎭ ᎨᏒ ᏧᏁᎬ ᏕᎨᏥᏅᏁᎸᎩ ᏗᏄᏬ; ᎠᎴ ᎨᏥᏃᏁᎸᎩ ᎠᏏ ᏞᎦ ᎤᎾᏣᏪᏐᎸᏍᏙᏗᏱ ᎨᏒ ᎬᏂ ᎢᏧᎳᎭ ᎨᏥᏅᏏᏙᎸᎯ ᎠᎴ ᎾᏍᏉ ᎠᎾᎵᏅᏟ ᏄᏂᎪᎸᎾ ᏂᎨᎬᏁᎸ, ᎾᏍᎩ ᏕᎨᏥᎸ ᎾᏍᎩᏯ ᎤᏅᏒ ᏂᎨᎬᏁᎸᎢ.

source: And I saw when the sixth stamp was undone, and there was a great earth-shock; and the sun became black as haircloth, and all the moon became as blood;
chr: ᎠᎴ ᏑᏓᎵᏁ ᎠᏍᏚᎲ ᎤᏍᏚᎢᏒ ᏕᏥᎦᏅᎩ, ᎠᎴ ᎬᏂᏳᏉ ᎦᏙᎯ ᎤᏣᏘ ᎤᎵᏖᎸᏅᎩ; ᎠᎴ ᏅᏙ ᎢᎦ-ᎡᎯ ᎬᎿᎨ ᏄᎵᏍᏔᏅᎩ ᎾᏍᎩᏯ ᎤᏏᏕᏅ ᎠᏄᏬ ᎪᏢᏔᏅᎯ, ᏅᏙᏃ ᏒᏃᏱ ᎡᎯ ᎩᎬ ᎾᏍᎩᏯ ᏄᎵᏍᏔᏅᎩ.

source: And the stars of heaven were falling to the earth, like green fruit from a tree before the force of a great wind.
chr: ᏃᏈᏏᏃ ᎦᎸᎶᎢ ᎠᏂᎧᎸ ᎤᏂᏅᎪᎣᏒᎩ ᎠᎴ ᎡᎶᎯ ᎤᏂᎳᎨᏯᏛᏨᎩ, ᎾᏍᎩᏯ ᏒᎦᏔ-ᎢᏳᏍᏗ ᏡᎬ ᏣᏂᏅᎪᎠᏍᎪ ᎤᎾᏓᏙᏗᏱ ᏂᎨᏒᎾ ᎨᏒ ᎤᎾᏓᏔᏅᎯ, ᎾᎯᏳ ᎤᏣᏘ ᎦᏃᎸᎥᏍᎬ ᏧᏖᎸᎲᏍᎪᎢ;

source: And the heaven was taken away like the roll of a book when it is rolled up; and all the mountains and islands were moved out of their places.
chr: ᎠᎴ ᎦᎸᎶᎢ ᎤᏓᏅᏒᎩ ᎾᏍᎩᏯ ᎪᏪᎵ ᏣᎦᏇᏅᏍᎪᎢ; ᎠᎴ ᏂᎦᏛ ᏕᎣᏓᎸ ᎠᎴ ᎠᎹᏰᎵ ᏚᏪᎧᎲᎢ ᏚᏓᏅᏒᎩ ᎾᎿ ᏄᎾᏛᏅᎢ.

source: And the kings of the earth, and the rulers, and the chief captains, and the men of wealth, and the strong, and every servant and free man, took cover in the holes and the rocks of the mountains;
chr: ᎠᎴ ᎤᏂᎬᏫᏳᎯ ᎡᎶᎯ ᎠᏁᎯ, ᎠᎴ ᎨᏥᎸᏉᏗ ᎠᏂᏍᎦᏯ, ᎠᎴ ᏧᏁᎿᎢ ᎠᏂᏍᎦᏯ, ᎠᎴ ᏄᏂᎬᏫᏳᏒ ᏗᎾᏓᏘᏂᏙᎯ, ᎠᎴ ᏧᎾᎵᏂᎩᏛ ᎠᏂᏍᎦᏯ, ᎠᎴ ᎾᏂᎥ ᏗᎨᏥᎾᏝᎢ, ᎠᎴ ᎾᏂᎥ ᏂᏗᎨᏥᎾᏝᎥᎾ, ᎤᎾᏗᏍᎦᎳᏅᎩ ᏚᏍᏓᎦᎸᎢ, ᎠᎴ ᏅᏲᎯ ᏕᎨᏒ ᏙᏓᎸᎢ;

source: And they say to the mountains and to the rocks, Come down on us, covering us from the face of him who is seated on the high seat, and from the wrath of the Lamb:
chr: ᎠᎴ ᏙᏓᎸ ᎠᎴ ᏅᏯ ᎯᎠ ᏂᏚᏂᏪᏎᎸᎩ, ᏍᎩᏯᏐᎥᎦ, ᎠᎴ ᏍᎩᏴᏍᎦᎸᎥᎦ ᎾᏍᎩ ᎣᎩᎪᏩᏛᏗᏱ ᏂᎨᏒᎾ ᎾᏍᎩ Ꮎ ᎦᏍᎩᎸ ᎤᏬᎵ, ᎠᎴ ᎤᏃᏕᎾ ᎠᎩᎾ ᎤᏔᎳᏬᎯᏍᏗ ᎨᏒ ᎣᎦᏢᏔᏍᏗᏱ ᏂᎨᏒᎾ;

source: For the great day of their wrath is come, and who may keep his place?
chr: ᎦᎸᏉᏗᏳᏰᏃ ᎢᎦ ᎾᎯᏳ ᎤᏔᎳᏬᎯᏍᏗ ᎨᏒ ᎤᏍᏆᎸᎲ; ᎦᎪᏃ ᏰᎵ ᎬᏩᎴᏗ ᎨᏎᏍᏗ?

source: After this I saw four angels in their places at the four points of the earth, keeping back the four winds in their hands, so that there might be no moving of the wind on the earth, or on the sea, or on any tree.
chr: ᎣᏂᏃ ᏅᎩ ᎢᏯᏂᏛ ᏗᏂᎧᎿᏩᏗᏙᎯ ᎥᎦᏥᎪᎥᎩ ᏅᎩ ᏂᏚᏅᏏᏴ ᎡᎶᎯ ᏓᏂᏙᎬᎩ, ᏚᏂᏂᏴᏒᎩ ᎤᏃᎴ ᏅᎩ ᏂᏙᏗᎦᎶᏍᎬ ᎡᎶᎯ, ᎾᏍᎩ ᎤᏃᎸᏗᏱ ᏂᎨᏒᎾ ᎡᎶᎯ, ᎠᎴ ᎠᎺᏉᎯ, ᎠᎴ ᏕᏡᎬᏉ.

source: And I saw another angel coming up from the east, having the mark of the living God: and he said with a great voice to the four angels, to whom it was given to do damage to the earth and the sea,
chr: ᎠᎴ ᏅᏩᏓᎴ ᏗᎧᎿᏩᏗᏙᎯ ᎥᏨᎪᎥᎩ ᏗᎧᎸᎬ ᎢᏗᏢ ᏧᏳᎵᏌᎳᏓᏩᏗᏒᎩ, ᎬᏂᏛ ᎤᏁᎳᏅᎯ ᎤᏤᎵ ᎤᏓᏰᎸᏙᏗ ᎨᏒ ᎦᏁᎲᎩ; ᎠᎴ ᎠᏍᏓᏯ ᏚᎵᏍᏓᏁᎸᎩ ᏅᎩ ᎢᏯᏂᏛ ᏗᏂᎧᎿᏩᏗᏙᎯ, ᎾᏍᎩ ᎨᏥᏁᎸᎯ ᏥᎨᏎ ᎪᎱᏍᏗ ᎤᏅᏁᏗᏱ ᎡᎶᎯ ᎠᎴ ᎠᎺᏉᎯ,

source: Do no damage to the earth, or the sea, or the trees, till we have put a mark on the servants of our God.
chr: ᎯᎠ ᏂᎨᏥᏪᏎᎸᎩ, ᏞᏍᏗ ᎪᎱᏍᏗ ᎢᏨᏁᎸᎩ ᎡᎶᎯ, ᎠᎴ ᎠᎺᏉᎯ, ᎠᎴ ᏕᏡᎬᎢ, ᎬᏂ ᏗᏗᏰᎸᏔᏅᎯ ᎨᏎᏍᏗ ᏗᏂᎬᏓᎨᏂ ᎢᎦᏁᎳᏅᎯ ᏧᏤᎵ ᏧᏅᏏᏓᏍᏗ.

source: And there came to my ears the number of those who had the mark on their brows, a hundred and forty-four thousand, who were marked out of every tribe of the people of Israel.
chr: ᎠᎴ ᎠᏆᏛᎦᏅᎩ ᎾᏂᎥ ᎾᏍᎩ ᏗᎨᏥᏰᎸᎳᏅᎯ ᎨᏒᎢ; ᎠᎴ ᎠᏍᎪᎯᏧᏈ ᏅᎦᏍᎪᎯ ᏅᎩᎦᎵ ᎢᏯᎦᏴᎵ ᎾᏂᎥᎩ ᏕᎨᏥᏰᎸᏔᏅᎩ ᏂᎦᏛ ᎢᏏᎵ ᏧᏪᏥ ᏓᏂᎳᏍᏓᎳᏩᏗᏒᎢ.

source: Of the tribe of Judah were marked twelve thousand: of the tribe of Reuben twelve thousand: of the tribe of Gad twelve thousand:
chr: ᏧᏓ ᎠᏂᎳᏍᏓᎸ ᏗᎪᏣᎴᏛ ᏔᎳᏚ ᎢᏯᎦᏴᎵ ᏕᎨᏥᏰᎸᏔᏅᎩ. ᎷᏈᏂ ᎠᏂᎳᏍᏓᎸ ᏗᎪᏣᎴᏛ ᏔᎳᏚ ᎢᏯᎦᏴᎵ ᏕᎨᏥᏰᎸᏔᏅᎩ. ᎦᏗ ᎠᏂᎳᏍᏓᎸ ᏗᎪᏣᎴᏛ ᏔᎳᏚ ᎢᏯᎦᏴᎵ ᏕᎨᏥᏰᎸᏔᏅᎩ.

source: Of the tribe of Asher twelve thousand: of the tribe of Naphtali twelve thousand: of the tribe of Manasseh twelve thousand:
chr: ᎠᏒ ᎠᏂᎳᏍᏓᎸ ᏗᎪᏣᎴᏛ ᏔᎳᏚ ᎢᏯᎦᏴᎵ ᏕᎨᏥᏰᎸᏔᏅᎩ. ᏁᏈᏓᎵ ᎠᏂᎳᏍᏓᎸ ᏗᎪᏣᎴᏛ ᏔᎳᏚ ᎢᏯᎦᏴᎵ ᏕᎨᏥᏰᎸᏔᏅᎩ. ᎻᎾᏒ ᎠᏂᎳᏍᏓᎸ ᏗᎪᏣᎴᏛ ᏔᎳᏚ ᎢᏯᎦᏴᎵ ᏕᎨᏥᏰᎸᏔᏅᎩ.

source: Of the tribe of Simeon twelve thousand: of the tribe of Levi twelve thousand: of the tribe of Issachar twelve thousand:
chr: ᏏᎻᏯᏂ ᎠᏂᎳᏍᏓᎸ ᏗᎪᏣᎴᏛ ᏔᎷᏚ ᎢᏯᎦᏴᎵ ᏕᎨᏥᏰᎸᏔᏅᎩ. ᎵᏫ ᎠᏂᎳᏍᏓᎸ ᏗᎪᏣᎴᏛ ᏔᎳᏚ ᎢᏯᎦᏴᎵ ᏕᎨᏥᏰᎸᏔᏅᎩ ᎢᏏᎦ ᎠᏂᎳᏍᏓᎸ ᏗᎪᏣᎴᏛ ᏔᎳᏚ ᎢᏯᎦᏴᎵ ᏕᎨᏥᏰᎸᎳᏅᎩ.

source: Of the tribe of Zebulun twelve thousand: of the tribe of Joseph twelve thousand: of the tribe of Benjamin were marked twelve thousand.
chr: ᏤᏈᎳᏂ ᎠᏂᎳᏍᏓᎸ ᏗᎪᏣᎴᏛ ᏔᎳᏚ ᎢᏯᎦᏴᎵ ᏕᎨᏥᏰᎸᏔᏅᎩ. ᏦᏩ ᎠᏂᎳᏍᏓᎸ ᏗᎪᏣᎴᏛ ᏔᎳᏚ ᎢᏯᎦᏴᎵ ᏕᎨᏥᏰᎸᏔᏅᎩ. ᏇᏂ ᎠᏂᎳᏍᏓᎸ ᏗᎪᏣᎴᏛ ᏔᎳᏚ ᎢᏯᎦᏴᎵ ᏕᎨᏥᏰᎸᎳᏅᎩ.

source: After these things I saw a great army of people more than might be numbered, out of every nation and of all tribes and peoples and languages, taking their places before the high seat and before the Lamb, dressed in white robes, and with branches in their hands,
chr: ᎣᏂᏃ ᎢᏴᏛ ᏓᏆᎧᎾᏅᎩ, ᎠᎴ ᎬᏂᏳᏉ, ᎤᏂᏧᏈᏍᏗ ᏴᏫ [ᏫᏕᏥᎪᎥᎩ] ᎾᏍᎩ ᎩᎶ ᏗᎬᏩᏎᎰᎲᏍᏗ ᏂᎨᏒᎾ, ᎾᏍᎩ ᏅᏓᏳᎾᏙᏣᎴᏛ ᎾᏂᎥ ᎤᎾᏓᏤᎵᏛ ᏴᏫ ᏓᏁᏩᏗᏒᎢ, ᎠᎴ ᎪᎱᏍᏗ ᏗᎾᏓᏛᎿ ᎨᏒᎢ, ᎠᎴ ᏴᏫ ᏓᏁᏩᏗᏒᎢ ᎠᎴ ᏧᏓᎴᏅᏛ ᏗᏂᏬᏂᏍᎩ ᎨᏒᎢ, ᎠᏂᏙᎾᎥᎩ ᎦᏍᎩᎸ ᎢᎬᏱᏗᏢ, ᎠᎴ ᎤᏃᏕᎾ ᎠᎩᎾ ᏄᏛᏅ ᎢᎬᏱᏗᏢ, ᏧᏁᎬ ᏚᎾᏄᏩᎥᎩ, ᎠᎴ ᏗᏂᏁᎲᎩ ᏧᏪᏲᏔ ᏧᎦᏄᏓᏅᎯᏛ;

source: Saying with a loud voice, Salvation to our God who is seated on the high seat, and to the Lamb.
chr: ᎠᎴ ᎠᏍᏓᏯ ᎤᏁᎷᏅᎩ, ᎯᎠ ᏄᏂᏪᏒᎩ, ᎠᎵᏍᏕᎸᏙᏗ ᎨᏒ ᎣᎦᏁᎳᏅᎯ ᎧᏁᎢᏍᏓᏁᏗ ᎨᏎᏍᏗ ᎾᏍᎩ ᎦᏍᎩᎸ ᏧᏬᎳ, ᎠᎴ ᎤᏃᏕᎾ ᎠᎩᎾ ᎧᏁᎢᏍᏓᏁᏗ ᎨᏎᏍᏗ.

source: And all the angels were round about the high seat, and about the rulers and the four beasts; and they went down on their faces before the high seat, and gave worship to God, saying,
chr: ᎠᎴ ᏂᎦᏛ ᏗᏂᎧᎿᏩᏗᏙᎯ ᎦᏍᎩᎸ ᏚᎾᏚᏫᏍᏛᎩ ᏓᏂᏙᎬᎩ, ᎠᎴ ᏧᎾᏛᏐᏅᎯ ᎠᎴ ᏅᎩ ᎢᏯᏂᏛ ᏗᏅᏃᏛ ᏄᎾᏛᏅᎢ, ᎠᎴ ᎦᏍᎩᎸ ᎢᎬᏱᏗᏢ ᏚᎾᎵᏯᏍᏚᏅᎩ, ᎠᎴ ᎤᏁᎳᏅᎯ ᎤᎾᏓᏙᎵᏍᏓᏁᎸᎩ;

source: So be it. Let blessing and glory and wisdom and praise and honour and power and strength be given to our God for ever and ever. So be it.
chr: ᎯᎠ ᎾᏂᏪᏍᎬᎩ, ᎡᎺᏅ; ᎣᏍᏛ ᎡᏣᏁᎢᏍᏓᏁᏗ ᎨᏒᎢ, ᎠᎴ ᎡᏣᎸᏉᏙᏗ ᎨᏒᎢ, ᎠᎴ ᎯᎦᏔᎾᎢᏳ ᎨᏒᎢ, ᎠᎴ ᎡᏣᎵᎮᎵᏤᏗ ᎨᏒᎢ, ᎠᎴ ᎡᏣᎸᏉᏗᏳ ᎨᏒᎢ, ᎠᎴ ᏣᎵᏂᎩᏗᏳ ᎨᏒᎢ, ᎠᎴ ᏣᎵᏂᎪᎯᏍᏗ ᎨᏒᎢ, ᏣᏤᎵ ᎨᏎᏍᏗ ᏍᎩᏯᏁᎳᏅᎯ ᏂᎪᎯᎸ ᎠᎴ ᏂᎪᎯᎸᎢ. ᎡᎺᏅ.

source: And one of the rulers made answer, saying to me, These who have on white robes, who are they, and where did they come from?
chr: ᎠᏂᏴᏫᏃ ᎾᏍᎩ Ꮎ ᏧᎾᏛᏐᏅᎯ ᎨᏒ ᎤᏁᏨᎩ, ᎯᎠ ᎾᎩᏪᏎᎸᎩ, ᎦᎪ ᎯᎠ Ꮎ ᏧᏁᎬ ᏧᎾᏄᏩᎢ ᏥᎩ? ᎠᎴ ᎭᏢ ᏧᎾᏓᎴᏁᎢ?

source: And I said to him, My lord, you have knowledge. And he said to me, These are they who came through the great testing, and their robes have been washed and made white in the blood of the Lamb.
chr: ᎯᎠᏃ ᏅᏥᏪᏎᎸᎩ, ᏣᎬᏫᏳᎯ ᏂᎯ ᎯᎦᏔᎭ. ᎯᎠᏃ ᎾᎩᏪᏎᎸᎩ, ᎯᎠᏍᎩᏂ Ꮎ ᎤᏣᏘ ᎠᎩᎵᏯ ᎨᏒ ᏅᏓᏳᏂᎶᏒᎯ, ᎠᎴ ᎤᏃᏕᎾ ᎠᎩᎾ ᎤᎩᎬᏱ ᏧᏅᎩᎶᎥᎯ ᏧᎾᏄᏬ ᎠᎴ ᏧᏁᎬ ᎢᏧᏅᏁᎸᎯ.

source: This is why they are before the high seat of God; and they are his servants day and night in his house: and he who is seated on the high seat will be a tent over them.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎤᏁᎳᏅᎯ ᎤᏤᎵ ᎦᏍᎩᎸ ᎢᎬᏱᏗᏢ ᏄᎾᏛᏅ, ᎠᎴ ᎪᎱᏍᏗ ᎬᏩᏛᏁᎭ ᎤᏤᎵ ᏗᎦᎳᏫᎢᏍᏗᏱ, ᎢᎦ ᎠᎴ ᎡᏃᏱ ᏗᎬᏩᏜᏍᏗ; ᎠᎴ ᎾᏍᎩ Ꮎ ᎦᏍᎩᎸ ᎤᏬᎵ ᎠᏁᎲ ᎡᎮᏍᏗ.

source: They will never be in need of food or drink: and they will never again be troubled by the burning heat of the sun:
chr: ᎿᏉ ᎥᏝ ᎠᎪᏄ ᏧᏂᏲᏏᏐᏗ ᏱᎨᏎᏍᏗ, ᎥᏝ ᎠᎴ ᎿᏉ ᏧᏂᏔᏕᎪᏗ ᏱᎨᏎᏍᏗ; ᎥᏝ ᎠᎴ ᏅᏙ ᎢᎦ ᎡᎯ ᎤᏗᎴᎩ ᏳᏂᎦᎵᏍᎨᏍᏗ, ᎠᎴ ᎪᎱᏍᏗ ᎤᏗᎴᎩ ᎨᏒᎢ.

source: For the Lamb who is on the high seat will be their keeper and their guide to fountains of living water: and God will make glad their eyes for ever.
chr: ᎤᏃᏕᎾᏰᏃ ᎠᎩᎾ ᎾᏍᎩ Ꮎ ᎦᏍᎩᎸ ᎠᏰᎵ ᏥᏄᏛᏅ ᏓᏳᏁᎶᎵ ᎠᎴ ᏙᏓᏳᎾᏘᏁᏏ ᎠᎹ ᎬᏂᏛ ᎠᎹ ᏙᏗᎦᏄᎪᎬᎢ; ᎠᎴ ᎤᏁᎳᏅᎯ ᏙᏓᎦᏅᎦᎸᎯ ᏂᎦᏛ ᏚᏂᎦᏌᏬᎸᎢ.

source: And when the seventh stamp was undone there was quiet in heaven for about half an hour.
chr: ᎦᎵᏉᎩᏁᏃ ᎠᏍᏚᎲ ᎤᏍᏚᎢᏒ ᎡᎳᏪ ᎤᏅᏅᎩ ᎦᎸᎳᏗ ᎠᏰᎵ ᎢᏳᏟᎶᏛ ᎢᎪᎯᏛ.

source: And I saw the seven angels who had their place before God; and seven horns were given to them.
chr: ᎦᎵᏉᎩᏃ ᎢᏯᏂᏛ ᏗᏂᎧᎿᏩᏗᏙᎯ ᎥᎦᏥᎪᎥᎩ ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᏄᏛᏅ ᎢᎬᏱᏗᏢ ᏣᏂᏙᎾᎠ; ᎦᎵᏉᎩᏃ ᏗᏤᎷᎩ ᏕᎨᏥᏕᎸᎩ ᎾᏍᎩ.

source: And another angel came and took his place at the altar, having a gold vessel for burning perfume; and there was given to him much perfume, so that he might put it with the prayers of all the saints on the gold altar which was before the high seat.
chr: ᎠᎴ ᏅᏩᏓᎴ ᏗᎧᎿᏩᏗᏙᎯ ᎤᎷᏨᎩ ᎠᎴ ᎠᏥᎸ-ᎨᎳᏍᏗᏱ ᎤᎴᏅᎩ, ᎠᏰᎲᎩ ᎠᏕᎸ-ᏓᎶᏂᎨ ᎪᏢᏔᏅᎯ ᎠᏜ ᎦᏩᏒᎩ ᎠᎪᎲᏍᏙᏗᏱ; ᎤᏣᏘᏃ ᎠᏥᏁᎸᎩ ᎠᏜ ᎦᏩᏒᎩ ᎾᏍᎩ ᎤᎵᏍᎪᎸᏙᏗᏱ ᎤᏠᏯᏍᏙᏗᏱ ᎠᎾᏓᏙᎵᏍᏗᏍᎬ ᏂᎦᏛ ᎤᎾᏓᏅᏘ, ᎾᎿ ᎠᏥᎸ-ᎨᎳᏍᏗᏱ ᎠᏕᎸ-ᏓᎶᏂᎨ ᎪᏢᏔᏅᎯ ᎦᏍᎩᎸ ᎢᎬᏱᏗᏢ ᏥᎦᎧᎭ.

source: And the smoke of the perfume, with the prayers of the saints, went up before God out of the angel's hand.
chr: ᎠᎴ ᎠᏜ ᎦᏩᏒᎩ ᏚᎦᏒᏍᏛ ᎾᎯᏳ ᎠᎵᏌᎳᏗᏍᎬᎩ ᎤᎾᏓᏅᏘ ᎠᎾᏓᏙᎵᏍᏗᏍᎬ ᏓᎵᏌᎳᏗᏍᎬ ᎤᏁᎳᏅᎯ ᏄᏛᏅ ᎢᎬᏱᏗᏢ ᏫᎦᎷᎬᎩ, ᏗᎧᎿᏩᏗᏙᎯ ᎤᏬᏰᏂ ᎠᏓᎴᎲᏍᎬᎩ.

source: And the angel took the vessel; and he made it full of the fire of the altar, and sent it down on the earth: and there came thunders and voices and flames and a shaking of the earth.
chr: ᏗᎧᎿᏩᏗᏙᎯᏃ ᎠᏜ ᎦᏩᏒᎩ ᎠᎪᎲᏍᏙᏗᏱ ᎤᎩᏒᎩ, ᎠᎴ ᎠᏥᎸ ᎤᎧᎵᎢᏍᏔᏅᎩ ᎠᏥᎸ-ᎨᎳᏍᏗᏱ ᎠᏞᏛ, ᎠᎴ ᎡᎶᎯ ᏭᏗᏅᏒᎩ; ᏚᏃᏴᎳᏒᎩᏃ, ᎠᎴ ᎤᏴᏓᏆᎶᎥᎩ, ᎠᎴ ᎠᎾᎦᎵᏍᎬᎩ, ᎠᎴ ᎡᎶᎯ ᎤᎵᏖᎸᏅᎩ.

source: And the seven angels who had the seven horns made ready for sounding them.
chr: ᎠᎴ ᎦᎵᏉᎩ ᎢᏯᏂᏛ ᏗᏂᎧᎿᏩᏗᏙᎯ, ᎾᏍᎩ ᎦᎵᏉᎩ ᏗᏤᎷᎩ ᏗᏂᏁᎯ ᎤᎾᏛᏅᎢᏍᏔᏅᎩ ᏧᏂᏃᏴᎵᏍᏙᏗᏱ.
